let data =
  '{"name":"大连长丰实业总公司","id":1,"children":[{"name":"5706军工厂一厂","id":15,"children":[{"name":"5706军工厂一厂子公司","id":16},{"name":"5706军工厂一厂二子公司","id":27},{"name":"5706军工厂三厂","id":28},{"name":"5706军工厂四厂","id":29},{"name":"5706军工厂五厂","id":30}]},{"name":"二厂","id":17},{"name":"三厂","id":18},{"name":"四厂","id":25},{"name":"五厂","id":26},{"name":"5706军工厂2厂","id":38},{"name":"5706军工厂3厂","id":39},{"name":"5706军工厂4厂","id":40},{"name":"5706军工厂5厂","id":41},{"name":"5706军工厂6厂","id":42},{"name":"5706军工厂7厂","id":43},{"name":"5706军工厂7厂","id":44},{"name":"5706军工厂8厂","id":45},{"name":"5706军工厂9厂","id":46},{"name":"5706军工厂10厂","id":47},{"name":"5706军工厂11厂","id":48},{"name":"5706军工厂12厂","id":49},{"name":"5706军工厂13厂","id":50},{"name":"5706军工厂14厂","id":51},{"name":"5706军工厂15厂","id":52},{"name":"5706军工厂16厂","id":53},{"name":"5706军工厂17厂","id":54},{"name":"5706军工厂18厂","id":55},{"name":"5706军工厂19厂","id":56},{"name":"5706军工厂20厂","id":57}]}';

// var obj = eval("(" + data + ")");
// console.log(typeof obj);
// console.log(obj.name);
console.log(JSON.parse(data));
